# 4.Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

number = int(input('Введите номер четверти: '))

if number == 1:
    print('Возможны значения x от 0 до бесконечности, y от 0 до бесконечности')
elif number == 2:
    print('Возможны значения x от минус бесконечности до 0, y от 0 до бесконечности')
elif number == 3:
    print('Возможны значения x от минус бесконечности до 0, y от минус бесконечности до 0')
elif number == 4:
    print('Возможны значения x от 0 до бесконечности, y от минус бесконечности до 0')
