# Вычислить число c заданной точностью d Пример: 
# при d = 0.001, π = 3.141.d=0.001,π=3.141.﻿﻿ 10^{-1} ≤ d ≤10^{-10}10 −1 ≤d≤10 −10 ﻿﻿ 
# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# Вычислить число c заданной точностью d Пример: при d = 0.001, π = 3.141.d=0.001,π=3.141.﻿﻿
# Задайте 1 натуральное число N. Напишите программу, которая составит список простых множителей числа N.

# Задайте 2 последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

# Задана 3 натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл 
# многочлен степени k. Пример: 
# k=2 => 2x² + 4x + 5 = 0 или x² + 5 = 0 или 10*x² = 0 35.
# Даны два файла, в каждом из которых находится запись многочлена. 

# Задача 4 - сформировать файл, содержащий сумму многочленов.
